cis126dl_users.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Managing Users and Groups</title>
<!-- 2016-10-07 Fri 11:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dennis Kibbe" />


</head>
<body>
<div id="content">
<h1 class="title">Managing Users and Groups</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Assignment Objectives</a></li>
<li><a href="#sec-3">3. Terms You Should Know</a></li>
<li><a href="#sec-4">4. Preparations</a></li>
<li><a href="#sec-5">5. Add a File to /etc/skel</a></li>
<li><a href="#sec-6">6. Change the Maximum Days a Password May Be Used</a></li>
<li><a href="#sec-7">7. Creating New Users</a>
<ul>
<li><a href="#sec-7-1">7.1. From the GUI</a></li>
<li><a href="#sec-7-2">7.2. From the Command Line</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Add a Supplemental Group</a></li>
<li><a href="#sec-9">9. Modify Account Expiration</a></li>
<li><a href="#sec-10">10. What to Submit</a></li>
<li><a href="#sec-11">11. Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Managing users and groups is an important administrative skill.  In this assignment you'll add new user accounts from the desktop and the command line.  The you will modify some account perimeters.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Assignment Objectives</h2>
<div class="outline-text-2" id="text-2">
<p>
<i>After successfully completing this assignment you will be able to:</i>
</p>

<ol class="org-ol">
<li>Create content in the <code>/etc/skel/</code> directory that will be copied to a new users' home directory.
</li>
<li>Modify system-wide login defaults.
</li>
<li>Create new user accounts using a desktop configuration tool
</li>
<li>Create a new user account from the command line.
</li>
<li>Add a user to a supplementary group using the <code>usermod</code> command.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Terms You Should Know</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt> /etc/passwd </dt><dd>A text file that describes user login accounts for the system.
</dd>

<dt> /etc/shadow </dt><dd>A text file which contains the passwords for accounts and optional password aging information.
</dd>

<dt> /etc/group </dt><dd>A text file listing the members of groups on the system.
</dd>

<dt> /etc/gshadow </dt><dd>A text file which contains the password information for groups.
</dd>

<dt> /etc/login.defs </dt><dd>A text file that defines the defaults for accounts.
</dd>

<dt> /etc/skel </dt><dd>Files placed in this directory will be copied to new users home directory.
</dd>

<dt> <code>chage</code> </dt><dd>Change user password expiry information.
</dd>

<dt> <code>groupadd</code> </dt><dd>Create a new group.
</dd>

<dt> <code>groupdel</code> </dt><dd>Remove a group from the system.
</dd>

<dt> <code>groupmod</code> </dt><dd>Modify a group account.
</dd>

<dt> <code>passwd</code> </dt><dd>Change a user's password.
</dd>

<dt> <code>useradd</code> </dt><dd>Add a new user to the system (Red Hat). The <code>passwd</code> command also needs to be run to set the password for the account.
</dd>

<dt> <code>adduser</code> </dt><dd>Add a new user to the system (Debian).
</dd>

<dt> <code>userdel</code> </dt><dd>Remove a user.
</dd>

<dt> <code>usermod</code> </dt><dd>Modify a user account.
</dd>

<dt> <code>vipw</code> </dt><dd>Safely edit the <code>/etc/passwd</code>, <code>/etc/shadow</code>, and <code>/etc/group</code> files.
</dd>

<dt> <code>who</code> or <code>w</code> </dt><dd>Show who is logged into the system.
</dd>

<dt> <code>id</code> </dt><dd>Print real and effective user and group IDs.
</dd>

<dt> <code>su</code> </dt><dd>Switch to another user (always use with the <code>--login</code> or <code>-l</code>).
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Preparations</h2>
<div class="outline-text-2" id="text-4">
<p>
Start a Fedora virtual machine.  Commands will be different on a Debian-based machine.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Add a File to /etc/skel</h2>
<div class="outline-text-2" id="text-5">
<p>
The <code>/etc/skel</code> directory as defined in <code>/etc/defaults/useradd</code> is the place to put any files or directories you want to be copied to a user's home directory when a new user is created.  For this assignment add a <i>welcome.txt</i> file (it can be an empty file) to the <code>/etc/skel</code> directory so it will copied to the home directories of the new accounts you create.
</p>

<pre class="example">
# touch /etc/skel/welcome.txt
</pre>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Change the Maximum Days a Password May Be Used</h2>
<div class="outline-text-2" id="text-6">
<p>
The <code>/etc/login.defs</code> file sets defaults for creating user accounts such as when passwords expire.
</p>

<p>
Be sure you create a backup before you edit the file.
</p>

<pre class="example">
$ su --login
# cp /etc/login.defs login.defs.bak
</pre>

<p>
Find the line that reads <b>PASSMAXDAYS 99999</b> and change it to <b>PASSMAXDAYS 90</b>.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Creating New Users</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> From the GUI</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Fedora has a graphical tool for creating new users.  See the Fedora System Administrative Guide under resources for how to use it to create a new user <i>Jay Student</i> with login as <i>jstudent</i>.  After creating the account logout as Tux and log in as <i>jstudent</i>.  Note that the <i>welcome.txt</i> file you created is in the home directory.  Run <code>chage -l jstudent</code> and note when the password will expire and that the account does not expire.
</p>

<p>
While still logged in as <i>jstudent</i> open a terminal and become root to create the second account.  Enter the root password when prompted.
</p>

<pre class="example">
$ su --login
Password:
#
</pre>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> From the Command Line</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Create a second account with the login <code>trillian</code> and the passphrase <code>Heart of Gold</code>.  A passphrase can be more secure than a password since a passphrase can contain spaces and longer passphrases can be more easily remembered.
</p>

<pre class="example">
# useradd -c "Tricia McMillan, Starship Heart of Gold" trillian
# passwd trillian
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Add a Supplemental Group</h2>
<div class="outline-text-2" id="text-8">
<p>
  Next add <code>trillian</code> to the <code>wheel</code> supplementary group.  Be sure to use a capital *
G*.
</p>

<pre class="example">
# usermod -aG wheel trillian
</pre>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Modify Account Expiration</h2>
<div class="outline-text-2" id="text-9">
<p>
Next change the account expiration to approx. <b>120 days</b> from today.  First display the account entry in the <code>shadow</code> file so you can compare the entry after making the change.
</p>

<pre class="example">
# grep trillian /etc/shadow
# chage -E YYYY-MM-DD trillian
# grep trillian /etc/shadow
</pre>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> What to Submit</h2>
<div class="outline-text-2" id="text-10">
<p>
<i>Logged in as root submit a single screenshot of the following:</i>
</p>

<ul class="org-ul">
<li>The output of <code>id jstudent</code>
</li>
<li>The output of <code>id trillian</code>.
</li>
<li>The output of <code>chage -l trillian</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Resources</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>man 5 login.defs
</li>
<li>man adduser
</li>
<li>man usermod
</li>
<li>man userdel
</li>
<li>man 5 passwd
</li>
<li>man passwd
</li>
<li>man chage
</li>
<li>man 5 login.defs
</li>
<li><a href="https://docs.fedoraproject.org/en-US/Fedora/24/html/System_Administrators_Guide/index.html">Fedora 24 System Administrator's Guide</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-09-21 Wed</p>
<p class="author">Author: Dennis Kibbe</p>
<p class="date">Created: 2016-10-07 Fri 11:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
